//// Технология OMP. Лаб. 1  
//// Задание 1. Определить, поддерживает ли компилятор C++ стандарт OpenMP, и, если поддерживает, 
//// то распечатать год и месяц принятия стандарта.
//
//#include <iostream>
//
//using namespace std;
//
//int main()
//{
//#ifdef _OPENMP
//	cout << "Open_MP is supported" << endl;
//	int YYYY = _OPENMP / 100;
//	int MM = _OPENMP % 100;
//	cout << "Supported Standard: Year: " << YYYY << " Month: " << MM << endl;
//#else
//	cout << "Open_MP is not supported" << endl;
//#endif
//}
